AlexLexx706/nRF24L01_stm32vldiscovery/NRF24L01/nrf24l01.c
/**
 ******************************************************************************
 * @file    nrf24l01.c
 * @author    Hampus Sandberg
 * @version    0.1
 * @date    2013-04-27
 * @brief    
 ******************************************************************************
 */

/*
TODO:
- NRF24L01_Write(), so the user don't have to think about splitting the data into payloads
- Implement how different addresses are handled
*/

/* Includes ------------------------------------------------------------------*/
#include "millis.h"

#include "nrf24l01_register_map.h"
#include "nrf24l01.h"
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_exti.h"
#include "misc.h"



/* Private defines -----------------------------------------------------------*/
//#if !defined(IRQ_PIN) && !defined(IRQ_DDR) && !defined(IRQ_PORT) && !defined(INTERRUPT_VECTOR) && !defined(IRQ_INTERRUPT)
//#error "Please define IRQ_PIN, IRQ_DDR, IRQ_PORT, INTERRUPT_VECTOR, IRQ_INTERRUPT in project properties"
//#endif
// #define IRQ_PIN                PORTD2    // INT0
// #define IRQ_DDR                DDRD
// #define IRQ_PORT            PORTD
// #define INTERRUPT_VECTOR    INT1_vect
// #define IRQ_INTERRUPT        1


#define TxPowerup(DEVICE)                writeRegisterOneByte(DEVICE, CONFIG, CONFIG_VALUE | ((1 << PWR_UP) | (0 << PRIM_RX)))
#define RxPowerup(DEVICE)                writeRegisterOneByte(DEVICE, CONFIG, CONFIG_VALUE | ((1 << PWR_UP) | (1 << PRIM_RX)))
#define ResetStatus(DEVICE)                writeRegisterOneByte(DEVICE, STATUS, (1 << TX_DS) | (1 << MAX_RT))
#define ResetStatusRxDr(DEVICE)          writeRegisterOneByte(DEVICE, STATUS, (1 << RX_DR))
#define ResetStatusAll(DEVICE)            writeRegisterOneByte(DEVICE, STATUS, (1 << TX_DS) | (1 << MAX_RT) | (1 << RX_DR))

#define IsValidPipe(PIPE)                ((PIPE) < 6)
#define GetPipeNumber(DEVICE)             (((NRF24L01_GetStatus(DEVICE)) & 0xF) >> 1)
#define GetPipeFromStatus(THE_STATUS)     (((THE_STATUS) & 0xF) >> 1)

#define DEFAULT_CHANNEL        77

//#define CONFIG_VALUE        ((1 << MASK_RX_DR) | (1 << EN_CRC) | (0 << CRCO))
#define CONFIG_VALUE        ((1 << EN_CRC) | (0 << CRCO))         // Test with RX data ready interrupt

#define TIMEOUT_WRITE        500
#define TX_MODE_TIMEOUT        500

#define MAX_PIPES            6


/* Private variables ---------------------------------------------------------*/
/* Private Function Prototypes -----------------------------------------------*/
static void enableRf(NRF24L01_Device* Device) { GPIO_SetBits(Device->CE_GPIO, Device->CE_Pin); }
static void disableRf(NRF24L01_Device* Device) { GPIO_ResetBits(Device->CE_GPIO, Device->CE_Pin); }

static void selectNrf24l01(NRF24L01_Device* Device) { GPIO_ResetBits(Device->CSN_GPIO, Device->CSN_Pin); }
static void deselectNrf24l01(NRF24L01_Device* Device) { GPIO_SetBits(Device->CSN_GPIO, Device->CSN_Pin); }

static void writeRegisterOneByte(NRF24L01_Device* Device, uint8_t Register, uint8_t Data);
static void readRegister(NRF24L01_Device* Device, uint8_t Register, uint8_t* Storage, uint8_t ByteCount);
static void writeRegister(NRF24L01_Device* Device, uint8_t Register, uint8_t * Data, uint8_t ByteCount);

static void flushTX(NRF24L01_Device* Device);
static void flushRX(NRF24L01_Device* Device);
static void resetToRx(NRF24L01_Device* Device);

static uint8_t getData(NRF24L01_Device* Device, uint8_t* Storage);
static uint8_t readByte(NRF24L01_Device* Device);
static uint8_t dataReady(NRF24L01_Device* Device);

static void powerUpRx(NRF24L01_Device* Device);
static void powerUpTx(NRF24L01_Device* Device);


/* Functions -----------------------------------------------------------------*/
/**
 * @brief    Initializes the nRF24L01
 * @param    Device: The device to use
 * @retval    None
 */

 void NRF24L01_Init(NRF24L01_Device* Device)
{
    Device->ChecksumErrors = 0;
    Device->byte_mode = False;
    
    uint8_t i;
    for (i = 0; i < MAX_PIPES; i++) { circularBuffer_Init(&Device->RxPipeBuffer[i]); }
    
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Initialize CE (Chip Enable) pin */
    if (Device->CE_GPIO == GPIOA)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    else if (Device->CE_GPIO == GPIOB)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    else if (Device->CE_GPIO == GPIOC)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    else if (Device->CE_GPIO == GPIOD)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);

    GPIO_InitStructure.GPIO_Mode        = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Pin         = Device->CE_Pin;
    GPIO_InitStructure.GPIO_Speed       = GPIO_Speed_50MHz;
    GPIO_Init(Device->CE_GPIO, &GPIO_InitStructure);

    /* Initialize CSN (Chip select) pin */
    if (Device->CSN_GPIO == GPIOA)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    else if (Device->CSN_GPIO == GPIOB)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    else if (Device->CSN_GPIO == GPIOC)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    else if (Device->CSN_GPIO == GPIOD)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);


    GPIO_InitStructure.GPIO_Mode         = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Pin         = Device->CSN_Pin;
    GPIO_InitStructure.GPIO_Speed         = GPIO_Speed_50MHz;
    GPIO_Init(Device->CSN_GPIO, &GPIO_InitStructure);

    disableRf(Device);
    deselectNrf24l01(Device);

    /* Initialize IRQ (Interrupt) pin */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
    if (Device->IRQ_GPIO == GPIOA)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    else if (Device->IRQ_GPIO == GPIOB)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    else if (Device->IRQ_GPIO == GPIOC)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    else if (Device->IRQ_GPIO == GPIOD)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);


