AlexLexx706/nRF24L01_stm32vldiscovery/NRF24L01/nrf24l01.c
    GPIO_InitStructure.GPIO_Mode         = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Pin         = Device->IRQ_Pin;
    GPIO_InitStructure.GPIO_Speed         = GPIO_Speed_50MHz;
    GPIO_Init(Device->IRQ_GPIO, &GPIO_InitStructure);

    /* Initialize interrupt */
    /* Connect EXTIx Line to IRQ pin */
    GPIO_EXTILineConfig(Device->IRQ_GPIO_PortSource, Device->IRQ_GPIO_PinSource);

    EXTI_InitTypeDef EXTI_InitStructure;
    EXTI_InitStructure.EXTI_Line         = Device->IRQ_EXTI_Line;
    EXTI_InitStructure.EXTI_LineCmd     = ENABLE;
    EXTI_InitStructure.EXTI_Mode         = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger     = EXTI_Trigger_Falling;
    EXTI_Init(&EXTI_InitStructure);

    /* Enable and set EXTIx Interrupt to the lowest priority */
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel                         = Device->IRQ_NVIC_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority     = 0x0F;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority             = 0x0F;
    NVIC_InitStructure.NVIC_IRQChannelCmd                     = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Initialize spi module */
    Device->SPIx_Init();

    /* Set channel */
    NRF24L01_SetRFChannel(Device, DEFAULT_CHANNEL);

    //set address
    NRF24L01_SetRxPipeAddress(Device, 0, DEVICE_1_2_ADDRESS);
    NRF24L01_SetTxAddress(Device,        DEVICE_1_2_ADDRESS);
    NRF24L01_SetRxPipeAddress(Device, 1, DEVICE_0_1_ADDRESS);

    /* Set length of incoming payload */
    writeRegisterOneByte(Device, RX_PW_P0, PAYLOAD_SIZE);
    writeRegisterOneByte(Device, RX_PW_P1, PAYLOAD_SIZE);
    
    // Enable all RX pipes
    NRF24L01_EnablePipes(Device, (PIPE_0 | PIPE_1));

    // Flush buffers
    flushTX(Device);
    flushRX(Device);
    ResetStatusAll(Device);

    // Start receiver
    Device->InTxMode = False;    /* Start in receiving mode */
    RxPowerup(Device);            /* Power up in receiving mode */
    enableRf(Device);            /* Listening for pakets */
    Device->Initialized = True;
}

/**
 * @brief    Write data and send it to the address specified in TX_ADDR
 * @param    Device: The device to use
 * @param    Data: Pointer to where the data is stored
 * @param    ByteCount: The number of bytes in Data
 * @retval    None
 * @note    W_TX_PAYLOAD commands wants LSByte first but Data is MSByte so the for loop is backwards
 *            Send as much data as defined in the payload
 */
void NRF24L01_WritePayload(NRF24L01_Device* Device, uint8_t* Data, uint8_t DataCount)
{
    /* You can only send the amount of data specified in MAX_DATA_COUNT */
    if (DataCount > MAX_DATA_COUNT) return;

    /* Wait until last payload is sent */
    while (Device->InTxMode)
    {
        /* TODO: FIX THIS!!! */
        uint8_t status = NRF24L01_GetStatus(Device);

        // Data Sent TX FIFO interrupt, asserted when packet transmitted on TX.
        if (status & (1 << TX_DS))
        {
            powerUpRx(Device);
        }
    }
    
    uint8_t checksum = NRF24L01_GetChecksum(Device, Data, DataCount);
    
    disableRf(Device);
    powerUpTx(Device);
    flushTX(Device);
    
    selectNrf24l01(Device);
    Device->SPIx_Write(W_TX_PAYLOAD);
    Device->SPIx_Write(DataCount);    // Write data count
    uint8_t i;
    for (i = 0; i < DataCount; i++) Device->SPIx_Write(Data[i]);        // Write data
    Device->SPIx_Write(checksum);    // Write checksum
    for (i++; i <= MAX_DATA_COUNT; i++) Device->SPIx_Write(PAYLOAD_FILLER_DATA);    // Fill the rest of the payload
    deselectNrf24l01(Device);
    enableRf(Device);
}


/**
 * @brief    Write data of arbitrary length [0-255]
 * @param    Device: The device to use
 * @param    Data: Pointer to where the data is stored
 * @param    ByteCount: The number of bytes in Data
 * @retval    None
 */
void NRF24L01_Write(NRF24L01_Device* Device, uint8_t* Data, uint8_t DataCount)
{
    // Only copy to good-sized parts if necessary
    if (DataCount <= MAX_DATA_COUNT)
    {
        NRF24L01_WritePayload(Device, Data, DataCount);
    }
    else
    {
        uint8_t tempData[MAX_DATA_COUNT];
        uint8_t tempDataCount = 0;
        uint8_t payloadCount = 0;

        uint16_t i;
        for (i = 0; i < DataCount; i++)
        {
            tempData[i - payloadCount * (MAX_DATA_COUNT)] = Data[i];
            tempDataCount++;
                
            if (tempDataCount == MAX_DATA_COUNT)
            {
                NRF24L01_WritePayload(Device, tempData, tempDataCount);
                tempDataCount = 0;
                payloadCount += 1;
                
                // ERROR: Doesn't seem to work if DataCount > 60
            }
        }
            
        // If it wasn't a multiple of MAX_DATA_COUNT write the rest
        if (tempDataCount)
        {
            NRF24L01_WritePayload(Device, Data, tempDataCount);
        }
    }
}

void NRF24L01_EnableByteMode(NRF24L01_Device* Device, Boolean value)
{
	Device->byte_mode = value;
}


/**
 * @brief    Set the address for the different RX pipes on the nRF24L01
 * @param    Device: The device to use
 * @param    Pipe: The pipe to set
 * @param    AddressMSBytes: The 4 highest bytes in the address
 * @param    AddressLSByte: The lowest byte in the address
 * @retval    The status register
 */
uint8_t NRF24L01_SetRxPipeAddressSeparated(NRF24L01_Device* Device, uint8_t Pipe, uint32_t AddressMSBytes, uint8_t AddressLSByte)
{
    if (Pipe <= 1)
    {
        selectNrf24l01(Device);
        uint8_t status = Device->SPIx_WriteRead(W_REGISTER | (RX_ADDR_P0 + Pipe));
        Device->SPIx_Write(AddressLSByte);
        uint8_t i;
        for (i = 0; i < 4; i++)
        {
            Device->SPIx_Write((AddressMSBytes >> 8*i) & 0xFF);
        }
        deselectNrf24l01(Device);
        
        return status;
    }
    else if (IsValidPipe(Pipe))
    {
        selectNrf24l01(Device);
        uint8_t status = Device->SPIx_WriteRead(W_REGISTER | (RX_ADDR_P0 + Pipe));
        Device->SPIx_Write(AddressLSByte);    // MSByte of address in pipe 2 to 5 is equal to RX_ADDR_P1[39:8]
        deselectNrf24l01(Device);
        
