AlexLexx706/nRF24L01_stm32vldiscovery/NRF24L01/nrf24l01.c
        return status;
    }
    return 0;
}

/**
 * @brief    Set the address for the TX on the nRF24L01
 * @param    Device: The device to use
 * @param    AddressMSBytes: The 4 highest bytes in the address
 * @param    AddressLSByte: The lowest byte in the address
 * @retval    The status register
 */
uint8_t NRF24L01_SetTxAddressSeparated(NRF24L01_Device* Device, uint32_t AddressMSBytes, uint8_t AddressLSByte)
{
    selectNrf24l01(Device);
    uint8_t status = Device->SPIx_WriteRead(W_REGISTER | TX_ADDR);
    Device->SPIx_WriteRead(AddressLSByte);
    uint8_t i;
    for (i = 0; i < 4; i++)
    {
        Device->SPIx_WriteRead((AddressMSBytes >> 8*i) & 0xFF);
    }
    deselectNrf24l01(Device);
    
    return status;
}

/**
 * @brief    Set the RF channel to transmit on
 * @param    Device: The device to use
 * @param    Channel: The channel
 * @retval    The status register or 0 if invalid channel
 * @note    Freq = 2400 + RF_CH [MHz], -> 2400 MHz - 2525 MHz operation frequencies
 */
uint8_t NRF24L01_SetRFChannel(NRF24L01_Device* Device, uint8_t Channel)
{
    if (Channel <= 125)
    {
        selectNrf24l01(Device);
        Device->SPIx_WriteRead(W_REGISTER | RF_CH);
        Device->SPIx_WriteRead(Channel);
        deselectNrf24l01(Device);

        return 1;
    }
    return 0;
}

/**
 * @brief    Reads the statusregister in the nRF24L01
 * @param    Device: The device to use
 * @param    None
 * @retval    The status register
 */
uint8_t NRF24L01_GetStatus(NRF24L01_Device* Device)
{
    selectNrf24l01(Device);
    uint8_t status = Device->SPIx_WriteRead(0);
    deselectNrf24l01(Device);
    
    return status;
}

/**
 * @brief    Get the TX FIFO status
 * @param    Device: The device to use
 * @param    None
 * @retval    The TX FIFO status
 */
uint8_t NRF24L01_GetFIFOStatus(NRF24L01_Device* Device)
{
    uint8_t FIFOStatus = 0;
    readRegister(Device, FIFO_STATUS, &FIFOStatus, 1);
    return FIFOStatus;
}

/**
 * @brief    Check if the TX FIFO is empty
 * @param    Device: The device to use
 * @param    None
 * @retval    1: If empty
 * @retval    0: If not empty
 */
uint8_t NRF24L01_TxFIFOEmpty(NRF24L01_Device* Device)
{
    uint8_t FIFOStatus = NRF24L01_GetFIFOStatus(Device);
    return ((FIFOStatus & (1 << TX_EMPTY)) >> TX_EMPTY);
}

/**
 * @brief    Enable the specified pipes on nRF24L01
 * @param    Device: The device to use
 * @param    Pipes: The pipes that should be enabled
 * @retval    The status register
 */
void NRF24L01_EnablePipes(NRF24L01_Device* Device, uint8_t Pipes)
{
    if (Pipes <= 0x3F)
    {
        uint8_t pipeValue;
        readRegister(Device, EN_RXADDR, &pipeValue, 1);
        
        pipeValue |= (Pipes);
        writeRegisterOneByte(Device, EN_RXADDR, pipeValue);
    }
}

/**
 * @brief    Disable the specified pipes on nRF24L01
 * @param    Device: The device to use
 * @param    Pipes: The pipes that should be disabled
 * @retval    The status register
 */
void NRF24L01_DisablePipes(NRF24L01_Device* Device, uint8_t Pipes)
{
    if (Pipes <= 0x3F)
    {
        uint8_t pipeValue;
        readRegister(Device, EN_RXADDR, &pipeValue, 1);
        pipeValue &= ~(Pipes);
        
        writeRegisterOneByte(Device, EN_RXADDR, pipeValue);
    }
}

/**
 * @brief    Get the pipe which there's data on
 * @param    Device: The device to use
 * @param    None
 * @retval    The pipe number
 */
uint8_t NRF24L01_GetPipeNumber(NRF24L01_Device* Device)
{
    return GetPipeNumber(Device);
}

/**
 * @brief    Check if a pipe has available data in it's buffer
 * @param    Device: The device to use
 * @param    Pipe: The pipe to check for data
 * @retval    The available data for the specified pipe
 */
uint8_t NRF24L01_GetAvailableDataForPipe(NRF24L01_Device* Device, uint8_t Pipe)
{
    if (IsValidPipe(Pipe))
    {
        return circularBuffer_GetCount(&Device->RxPipeBuffer[Pipe]);
    }
    return 0;
}

/**
 * @brief    Get a certain amount of data from a specified pipe
 * @param    Device: The device to use
 * @param    Pipe: The pipe to check for data
 * @param    Storage: Pointer to where the data should be stored
 * @param    DataCount: The amount of data to get
 * @retval    None
 * @note    It's good to check that the requested amount of data is available
            first by calling NRF24L01_GetAvailableDataForPipe()
 */
void NRF24L01_GetDataFromPipe(NRF24L01_Device* Device, uint8_t Pipe, uint8_t* Storage, uint8_t DataCount)
{
    if (IsValidPipe(Pipe))
    {
        uint8_t i;
        for (i = 0; i < DataCount; i++)
        {
            Storage[i] = circularBuffer_Remove(&Device->RxPipeBuffer[Pipe]);
        }
    }
}

/**
 * @brief    Get the checksum for a package of data
 * @param    Device: The device to use
 * @param    Data: The data for which to calculate the checksum on
 * @param    DataCount: The amount of data
 * @retval    The calculated checksum
 * @note    Checksum = ~(DataCount + Data1 + Data2 + ... + Data N)
 */
uint8_t NRF24L01_GetChecksum(NRF24L01_Device* Device, uint8_t* Data, uint8_t DataCount)
{
    volatile uint8_t checksum = DataCount;
    uint8_t i;
    for (i = 0; i < DataCount; i++)
    {
        checksum += Data[i];
    }
    return ~checksum;
}

/**
 * @brief    Get the amount of checksum errors that has occurred
 * @param    Device: The device to use
 * @param    None
 * @retval    The amount of checksum errors
 */
uint16_t NRF24L01_GetChecksumErrors(NRF24L01_Device* Device)
{
    return Device->ChecksumErrors;
}


/**
 * @brief    Write some debug info to the UART
 * @param    Device: The device to use
 * @param    None
 * @retval    None
 */
/*
void NRF24L01_WriteDebugToUart(NRF24L01_Device* Device)
{
    UART_WriteString("------------\r");
    uint8_t status = NRF24L01_GetStatus(Device);
    UART_WriteString("Status: ");
    UART_WriteHexByte(status, 1);
    UART_WriteString("\r");
    
    uint8_t pipe = NRF24L01_GetPipeNumber(Device);
    UART_WriteString("Pipe: ");
    UART_WriteUintAsString(pipe);
    UART_WriteString("\r");
    
    uint8_t en_rxaddr;
    readRegister(Device, EN_RXADDR, &en_rxaddr, 1);
    UART_WriteString("EN_RXADDR: ");
    UART_WriteHexByte(en_rxaddr, 1);
    UART_WriteString("\r");

    uint8_t addrTx[5];
    readRegister(Device, TX_ADDR, addrTx, 5);
    UART_WriteString("TX_ADDR: ");
    UART_WriteHexByte(addrTx[0], 1);
    UART_WriteHexByte(addrTx[1], 0);
    UART_WriteHexByte(addrTx[2], 0);
    UART_WriteHexByte(addrTx[3], 0);
    UART_WriteHexByte(addrTx[4], 0);
    UART_WriteString("\r");

