AlexLexx706/nRF24L01_stm32vldiscovery/NRF24L01/nrf24l01.c
    uint8_t addr0[5];
    readRegister(Device, RX_ADDR_P0, addr0, 5);
    UART_WriteString("RX_ADDR_P0: ");
    UART_WriteHexByte(addr0[0], 1);
    UART_WriteHexByte(addr0[1], 0);
    UART_WriteHexByte(addr0[2], 0);
    UART_WriteHexByte(addr0[3], 0);
    UART_WriteHexByte(addr0[4], 0);
    UART_WriteString("\r");

    uint8_t addr1[5];
    readRegister(Device, RX_ADDR_P1, addr1, 5);
    UART_WriteString("RX_ADDR_P1: ");
    UART_WriteHexByte(addr1[0], 1);
    UART_WriteHexByte(addr1[1], 0);
    UART_WriteHexByte(addr1[2], 0);
    UART_WriteHexByte(addr1[3], 0);
    UART_WriteHexByte(addr1[4], 0);
    UART_WriteString("\r");

    uint8_t addr2;
    readRegister(Device, RX_ADDR_P2, &addr2, 1);
    UART_WriteString("RX_ADDR_P2: ");
    UART_WriteHexByte(addr2, 1);
    UART_WriteString("\r");

    uint8_t addr3;
    readRegister(Device, RX_ADDR_P3, &addr3, 1);
    UART_WriteString("RX_ADDR_P3: ");
    UART_WriteHexByte(addr3, 1);
    UART_WriteString("\r");

    uint8_t addr4;
    readRegister(Device, RX_ADDR_P4, &addr4, 1);
    UART_WriteString("RX_ADDR_P4: ");
    UART_WriteHexByte(addr4, 1);
    UART_WriteString("\r");

    uint8_t addr5;
    readRegister(Device, RX_ADDR_P5, &addr5, 1);
    UART_WriteString("RX_ADDR_P5: ");
    UART_WriteHexByte(addr5, 1);
    UART_WriteString("\r");
}
*/

/* Private Functions ---------------------------------------------------------*/
/**
 * @brief    Write one byte to a register in the nRF24L01
 * @param    Device: The device to use
 * @param    Register: The register to read from
 * @param    Data: The byte to write
 * @retval    None
 */
static void writeRegisterOneByte(NRF24L01_Device* Device, uint8_t Register, uint8_t Data)
{
    if (IS_VALID_REGISTER(Register))
    {
        selectNrf24l01(Device);
        Device->SPIx_WriteRead(W_REGISTER | (REGISTER_MASK & Register));
        Device->SPIx_WriteRead(Data);
        deselectNrf24l01(Device);
    }        
}

/**
 * @brief    Reads data from a register in the nRF24L01
 * @param    Device: The device to use
 * @param    Register: The register to read from
 * @param    Storage: Pointer to where to store the read data
 * @param    ByteCount: How many bytes to read
 * @retval    The status register
 * @note    LSByte is read first
 */
static void readRegister(NRF24L01_Device* Device, uint8_t Register, uint8_t* Storage, uint8_t ByteCount)
{
    if (IS_VALID_REGISTER(Register))
    {
        selectNrf24l01(Device);
        Device->SPIx_WriteRead(R_REGISTER | Register);
        uint8_t i;
        for (i = 0; i < ByteCount; i++)
        {
            Storage[i] = Device->SPIx_WriteRead(0);
        }
        deselectNrf24l01(Device);
    }    
}

/**
 * @brief    Write data to a register in the nRF24L01
 * @param    Device: The device to use
 * @param    Register: The register to read from
 * @param    Storage: Pointer to where to store the read data
 * @param    ByteCount: How many bytes to read
 * @retval    None
 */
static void writeRegister(NRF24L01_Device* Device, uint8_t Register, uint8_t* Data, uint8_t ByteCount)
{
    if (IS_VALID_REGISTER(Register))
    {
        selectNrf24l01(Device);
        Device->SPIx_Write(W_REGISTER | Register);
        uint8_t i;
        for (i = 0; i < PAYLOAD_SIZE; i++)
        {
            Device->SPIx_WriteRead(Data[i]);
        }
        deselectNrf24l01(Device);
    }    
}

/**
 * @brief    Flush the TX buffer
 * @param    Device: The device to use
 * @retval    None
 */
static void flushTX(NRF24L01_Device* Device)
{
    selectNrf24l01(Device);
    Device->SPIx_WriteRead(FLUSH_TX);
    deselectNrf24l01(Device);
}

/**
 * @brief    Flush the RX buffer
 * @param    Device: The device to use
 * @retval    None
 */
static void flushRX(NRF24L01_Device* Device)
{
    selectNrf24l01(Device);
    Device->SPIx_WriteRead(FLUSH_RX);
    deselectNrf24l01(Device);
}

/**
 * @brief    Reset everything and power up as a receiver
 * @param    Device: The device to use
 * @retval    None
 */
static void resetToRx(NRF24L01_Device* Device)
{
    disableRf(Device);
    RxPowerup(Device);
    enableRf(Device);
    Device->InTxMode = False;
        
    ResetStatus(Device);
}

/**
 * @brief    Gets data from the RX buffer
 * @param    Device: The device to use
 * @param    Storage: Pointer to where the data should be stored
 * @retval    The amount of data received
 * @note    The checksum is checked here and if it doesn't match it will return 0 as
 *            the amount of data
 */
static uint8_t getData(NRF24L01_Device* Device, uint8_t* Storage)
{    
    selectNrf24l01(Device);
    Device->SPIx_WriteRead(R_RX_PAYLOAD);
    uint8_t dataCount = Device->SPIx_WriteRead(PAYLOAD_FILLER_DATA);
    uint8_t i;

    uint8_t count = dataCount + 1 ? dataCount + 1 <= PAYLOAD_SIZE : PAYLOAD_SIZE;

    for (i = 0; i < count; i++)
    {
        Storage[i] = Device->SPIx_WriteRead(PAYLOAD_FILLER_DATA);
    }    

    deselectNrf24l01(Device);
    flushRX(Device);
    writeRegisterOneByte(Device, STATUS, (1 << RX_DR));
    return dataCount;
}

static uint8_t readByte(NRF24L01_Device* Device)
{
    selectNrf24l01(Device);
    Device->SPIx_WriteRead(R_RX_PAYLOAD);
    uint8_t res = Device->SPIx_WriteRead(PAYLOAD_FILLER_DATA);
    deselectNrf24l01(Device);
    flushRX(Device);
    writeRegisterOneByte(Device, STATUS, (1 << RX_DR));
    return res;
}


/**
 * @brief    Checks if there is data available
 * @param    Device: The device to use
 * @retval    0: If no data is ready
 * @retval    1: If data is ready
 */
static uint8_t dataReady(NRF24L01_Device* Device)
// Checks if data is available for reading
{
    static uint32_t timeoutTimer = 0;
    if (Device->InTxMode)
    {
        if (millis() - timeoutTimer >= TX_MODE_TIMEOUT) resetToRx(Device);
        return 0;
    }
    
    volatile uint8_t status = NRF24L01_GetStatus(Device);
    return (status & (1 << RX_DR));
}

/**
 * @brief    Power up in RX mode
 * @param    Device: The device to use
 * @retval    None
 */
static void powerUpRx(NRF24L01_Device* Device)
{
    Device->InTxMode = False;
    writeRegisterOneByte(Device, CONFIG, CONFIG_VALUE | ((1 << PWR_UP) | (1 << PRIM_RX)));
    writeRegisterOneByte(Device, STATUS, (1 << TX_DS) | (1 << MAX_RT));
}

/**
 * @brief    Power up in TX mode
 * @param    Device: The device to use
 * @retval    None
 */
static void powerUpTx(NRF24L01_Device* Device)
{
    Device->InTxMode = True;
    writeRegisterOneByte(Device, CONFIG, CONFIG_VALUE | ((1 << PWR_UP) | (0 << PRIM_RX)));
}

/* Interrupt Service Routines ------------------------------------------------*/
void NRF24L01_Interrupt(NRF24L01_Device* Device)
{
    uint8_t status = NRF24L01_GetStatus(Device);
    // Data Sent TX FIFO interrupt, asserted when packet transmitted on TX.
    if (status & (1 << TX_DS))
    {
        ResetStatus(Device);
        powerUpRx(Device);
        //GPIO_SetBits(GPIOC, GPIO_Pin_9);
    }
    else if (status & (1 << MAX_RT))
    {
        ResetStatus(Device);
        powerUpRx(Device);
    }
    else if (status & (1 << RX_DR))
    {
        uint8_t pipe = GetPipeFromStatus(status);

        if (IsValidPipe(pipe))
        {
        	if (Device->byte_mode == False )
        	{
				uint8_t buffer[MAX_DATA_COUNT];
				uint8_t availableData = getData(Device, buffer);

				uint8_t receivedChecksum = buffer[availableData];
				uint8_t calculatedChecksum = NRF24L01_GetChecksum(Device, buffer, availableData);

				if (receivedChecksum == calculatedChecksum)
				{
					uint8_t i;

					for (i = 0; i < availableData; i++)
					{
						if (!circularBuffer_IsFull(&Device->RxPipeBuffer[pipe]))
							circularBuffer_Insert(&Device->RxPipeBuffer[pipe], buffer[i]);
					}
				}
				else
				{
					// Checksum error
					Device->ChecksumErrors++;
				}
        	}
        	//чтение байта из пакета, тестовый режим.
        	else
        	{
        		uint8_t data = readByte(Device);

				if (!circularBuffer_IsFull(&Device->RxPipeBuffer[pipe]))
					circularBuffer_Insert(&Device->RxPipeBuffer[pipe], data);
        	}
        }
        ResetStatusRxDr(Device);
    }
}
